<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"9730abfaa6b1211b23d12922a9711b3c7a53c881f1d8f04fb5c21eb5057971ce","plan_job_ref":"Job Test plan target and replace #316 at https://github.com/dflook/terraform-github-actions/actions/runs/4031732531","plan_hash":"513cebb31feee8b4b9d0afacb899e1fc1536601e578a6a4196d5761005bce1ff","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "mrOlQu0c4n" -> (known after apply)
  ~ foreach = "CZ6K2kS9AK" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #316](https://github.com/dflook/terraform-github-actions/actions/runs/4031732531)